import { expect } from 'chai';


describe("string", () => {
    it("string replace", () => {
        const str = "-1x6,0.6677,0.33,0.420,0.10,2.1,2.0,2.30,2.445,4.54545,110.3,111.34,1234.55,789123.90,49.40,-1,30.10x4,49.70x9,37x7,39.90x10,33.50x6,25.60x3,29.30x7,25.60x5,36.50x6,47.30x5,50.80,47.30,36.50x4,29.30x12,40.10x9,43.60x5,31.80x3,27.30,26.40x2,16.60,32.40,36.50x2,40.10x13,29.30x4,25.60x6,40.10x11,43.60x3,32.80x5,25.60x3,22x2,18.50,25.60,21.60,25.60x12,14.90x6,18.50x5,7.70,18.50x3,25.60x5,50.80x5,47.30x8,22x4,18.50,4.10x10,7.70x7,11.20x2,11,13x2,12x4,13.50x3,20x2,29x3,25x4,28,20.50x2,15.50x6,17.50x2,16.50x3,20.50x4,22.50x5,25.50x4,26.50,29.50x8,30,37x3,40.50x2,43.50x11,42x5,45.50x3,32.50x7,27.50,30,40.50x6,44.50x4,47,40.50x3,28,27.50,32.50x2,36.50,41x2,44.50,38,28.50x2,-1x11";

        console.log("------------------");

        const s = /(\d{2,})\.*/;
        const d = "$1";
        // const m = str.match(/\-1/g);
        // const m = str.match(/(\d{2,})\.*/g);
        // console.log(m);
        console.log("------------------");
        const t = str.replace(/\-1/g, "?");             // -1替换成？
        const t1 = t.replace(/(\d{2,})\.\d*/g, "$1");   // >=10.0f 省略小数部分
        const t2 = t1.replace(/0(\.\d\d)\d*/g, "$1");   // >0 <1.0f 保留两位小数，省略整数部分
        const t3 = t2.replace(/(\d\.\d)\d*/g, "$1");    // >=1.0f <10.0f 保留一位小数

        console.log(str);
        console.log("-------------------");
        console.log(t);
        console.log("-------------------");
        console.log(t1);
        console.log("-------------------");
        console.log(t2);
        console.log("-------------------");
        console.log(t3);

        // var re = /(\w+)\s(\w+)/;
        // var str1 = "zara ali";
        // var newstr = str1.replace(re, "$2, $1");
        // console.log(newstr); // ali, zara
    });

})